{
    "snxStaked":"There are 3 data points in this section:\nSNX Staked: The percentage of SNX that is staked\nTotal SNX Staked: The number of SNX that is currently staked\nStaked Value: The USD value of all SNX that is currently staked\n\nTo get the total SNX Staked Percentage, first we need to get the total SNX Staked and the total Supply of SNX. After getting both of these numbers, the calculation to get the percent staked becomes:\n\n\t(Total SNX Staked / Total Supply) * 100\n\nTo get the total SNX Staked, we query the snxHolders endpoint. \n\nThe snxHolders endpoint gives us access to every holder of SNX, along with some useful data points about each holder of SNX. The data points we are interested in is “balanceOf” and “collateral” and “initialDebtOwnership”.\n\nbalanceOf gives the current balance of SNX for the user.\nCollateral gives the current amount of SNX locked as collateral\ninitialDebtOwnership lets us know if the user has taken on any debt from the debt pool\n\nTo get the total supply, we call snxHolders and sum the balanceOf for each address to get the total SNX supply. \n\nHere is an example query for total supply you can run in The Graph’s playground. Please note that the playground limits responses to 1,000.\n\n{\n  snxholders(\n    first:1000\n    orderBy: balanceOf\n    orderDirection: desc\n  ){\n    balanceOf\n  }\n}\n\nAn example query for total SNX staked. We query the snxholders endpoint, and sort by collateral with the largest values first. Then we filter the results by specifying “where initial debt ownership is not 0”. This specification indicates that we only want collateral that is part of the debt pool.\n\n{\n  snxholders(\n    first:1000\n    orderBy: collateral\n    orderDirection: desc\n    where:{\n      initialDebtOwnership_not:0\n    }\n  ){\n    collateral\n  }\n}\n\nTo get the staked value, the calculation is:\n\n\t“Total SNX Staked” * “SNX rate in USD”\n\nwe query the “latestRate” endpoint to get the most recent USD rate for SNX. Here is an example query you can run in the playground to see the latest rate:\n\n{\n  latestRate(id:\"SNX\"){\n    id\n    rate\n  }\n"
}